# Préparation des données

### Import des librairies

In [1]:
import pandas as pd
import numpy as np

### Création du dataset

In [8]:
data = {'Prénom': ["Yann","Hugo","Andrew"], 'Nom': [ "Lecun","Larochelle","Ng"],'age': ["53", np.NaN, "Etats-Unis"],'Ville': ["New-York", "Canada", "42"],'Profession': ["Chercheur", "Chercheur", "Chercheur"]}
df = pd.DataFrame(data=data)
df

          Nom Profession  Prénom     Ville         age
0       Lecun  Chercheur    Yann  New-York          53
1  Larochelle  Chercheur    Hugo    Canada         NaN
2          Ng  Chercheur  Andrew        42  Etats-Unis

## Data Cleaning :

On supprime la colonne Profession qui n'a pas de valeur :

In [9]:
df.drop(columns=["Profession"], inplace=True)

In [10]:
df = df.set_value(1, "age", "47")
df = df.set_value(2, "age", "42")
df.at[1, "age"] = 47
df.at[2, "age"] = 42

D:\Programmes\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: set_value is deprecated and will be removed in a future release. Please use .at[] or .iat[] accessors instead
  """Entry point for launching an IPython kernel.
D:\Programmes\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: FutureWarning: set_value is deprecated and will be removed in a future release. Please use .at[] or .iat[] accessors instead

In [11]:
df

          Nom  Prénom     Ville age
0       Lecun    Yann  New-York  53
1  Larochelle    Hugo    Canada  47
2          Ng  Andrew        42  42

In [13]:
df.at[2, "Ville"] = "San Francisco"

In [14]:
df.head() #uniquement les premières lignes

          Nom  Prénom          Ville age
0       Lecun    Yann       New-York  53
1  Larochelle    Hugo         Canada  47
2          Ng  Andrew  San Francisco  42

## Feature engineering :

### Date :

In [15]:
date = {'Date': ["11/03/2018","01/03/2018"]}
df_date = pd.DataFrame(data=date)
df_date

         Date
0  11/03/2018
1  01/03/2018

In [16]:
df_date.dtypes

Date    object
dtype: object

In [17]:
df_date['Date'] = pd.to_datetime(df_date['Date'])

In [18]:
df_date.dtypes

Date    datetime64[ns]
dtype: object

In [19]:
from datetime import datetime
 
df_date['Year'] = df_date['Date'].apply(lambda x: x.year)
df_date['Month'] = df_date['Date'].apply(lambda x: x.month)
df_date.head()

        Date  Year  Month
0 2018-11-03  2018     11
1 2018-01-03  2018      1

In [20]:
seasons = [0,0,1,1,1,2,2,2,3,3,3,0] #dec - feb is winter, then spring, summer, fall etc
df_date['seasons'] = df_date['Month'].apply(lambda x: seasons[x-1])

In [21]:
df_date

        Date  Year  Month  seasons
0 2018-11-03  2018     11        3
1 2018-01-03  2018      1        0